Revit 2027 API
OverrideGraphicSettings.CutForegroundPatternColor Property
 The override color of the foreground pattern of cut faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color CutForegroundPatternColor { get; }
Public ReadOnly Property CutForegroundPatternColor As Color
	Get
public:
property Color^ CutForegroundPatternColor {
	Color^ get ();
}
member CutForegroundPatternColor : Color with get
Property Value
Color
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace